; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=46, remove_proportion=0.101, bases=18, instance_id=13, output=./training, seed=54

(define (problem warehouse-13)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 - base
    )
    (:init
        (to-remove box9)
        (to-remove box20)
        (to-remove box29)
        (to-remove box36)
        (clear box39)
        (on box39 box32)
        (on box32 box34)
        (on box34 box29)
        (on-base box29 base1)
        (clear box27)
        (on box27 box10)
        (on-base box10 base2)
        (clear box14)
        (on-base box14 base3)
        (clear box23)
        (on-base box23 base4)
        (clear box22)
        (on box22 box36)
        (on-base box36 base5)
        (clear box35)
        (on box35 box43)
        (on-base box43 base6)
        (clear box8)
        (on box8 box40)
        (on box40 box9)
        (on-base box9 base7)
        (clear box33)
        (on box33 box4)
        (on box4 box46)
        (on box46 box38)
        (on box38 box45)
        (on-base box45 base8)
        (clear box20)
        (on box20 box25)
        (on box25 box24)
        (on box24 box31)
        (on-base box31 base9)
        (clear box18)
        (on-base box18 base10)
        (clear box16)
        (on box16 box6)
        (on-base box6 base11)
        (clear box30)
        (on-base box30 base12)
        (clear box42)
        (on box42 box3)
        (on box3 box7)
        (on box7 box37)
        (on box37 box28)
        (on-base box28 base13)
        (clear box19)
        (on-base box19 base14)
        (clear box26)
        (on box26 box13)
        (on box13 box44)
        (on box44 box41)
        (on box41 box5)
        (on-base box5 base15)
        (clear box11)
        (on box11 box2)
        (on box2 box1)
        (on-base box1 base16)
        (clear box17)
        (on-base box17 base17)
        (clear box12)
        (on box12 box15)
        (on box15 box21)
        (on-base box21 base18)
    )
    (:goal (and 
        (removed box9)
        (removed box20)
        (removed box29)
        (removed box36)
    ))
)

; plan
1. (move box22 box36 box11)
   deleted: (clear box11) (on box22 box36)
   added: (on box22 box11) (clear box36)
   goals met: 0 of 4
2. (move box39 box32 box12)
   deleted: (clear box12) (on box39 box32)
   added: (on box39 box12) (clear box32)
   goals met: 0 of 4
3. (move box32 box34 box14)
   deleted: (clear box14) (on box32 box34)
   added: (on box32 box14) (clear box34)
   goals met: 0 of 4
4. (move box34 box29 box16)
   deleted: (clear box16) (on box34 box29)
   added: (on box34 box16) (clear box29)
   goals met: 0 of 4
5. (move box8 box40 box17)
   deleted: (clear box17) (on box8 box40)
   added: (on box8 box17) (clear box40)
   goals met: 0 of 4
6. (move box40 box9 box18)
   deleted: (clear box18) (on box40 box9)
   added: (on box40 box18) (clear box9)
   goals met: 0 of 4
7. (remove box20 box25)
   deleted: (on box20 box25) (clear box20)
   added: (removed box20) (clear box25)
   goals met: 1 of 4
8. (remove-from-base box29 base1)
   deleted: (on-base box29 base1) (clear box29)
   added: (removed box29) (clear-base base1)
   goals met: 2 of 4
9. (remove-from-base box36 base5)
   deleted: (on-base box36 base5) (clear box36)
   added: (removed box36) (clear-base base5)
   goals met: 3 of 4
10. (remove-from-base box9 base7)
   deleted: (on-base box9 base7) (clear box9)
   added: (removed box9) (clear-base base7)
   goals met: 4 of 4
